package LCGo;

public class addDigits {
    /**
     * 678 = 6 * 100       + 7 * 10    + 8
     *     = 6 * (99+1)    + 7 * (9+1) + 8       //下步把括号里的+1，提取到后面去
     *     = 6 * 99        + 7 * 9     + 8 + 6 + 7
     *     = 6 * 99        + 7 * 9     + 21    //这里已经计算完了6+7+8，然后用相同方法再次分解21
     *     = 6 * 99        + 7 * 9     + 2 * 9 + 1 + 2
     *     = 6 * 99        + 7 * 9     + 2 * 9 + 3    //这里计算完了2+1，可以看到3前面的都可以被9整除掉
     * @param num
     * @return
     */
    public int addDigits(int num) {
        return (num - 1) % 9 + 1;
    }
}
